// D-триггер, срабатывающий по положительному фронту clk.
// В момент перехода clk из 0 в 1 значение d копируется в out.
// До следующего положительного фронта clk выход out не меняется.

module task3_verilog (
    input  logic d,     // Вход данных, запоминаем бит,
    input  logic clk,   // Тактовый сигнал: по его положительному фронту
                        // триггер считывает d и записывает в out,
    output logic out    // Выход: хранит последнее записанное значение d
                        // до след. положит. фронта clk.
);

    // По положительному фронту clk значение d копируется в out
    // Неблокирующее присваивание <= соответствует работе триггера.
    always_ff @(posedge clk) begin
        out <= d;
    end

endmodule
